app/views/static/gossip.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---

<p>Auteur du Potin : <%=@current_gossip.user.first_name %> </p>