app/views/static/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    <%@all_gossips.each do |elem|%>
    <%=elem.user.first_name %> : <%= elem.title%>  <%= link_to "Cliquez ici pour lire le potin.", gossip_pre_path(elem.id), :class => "nav-link"%> <br/>