app/controllers/static_controller.rb

  def home

    @all_gossips = Gossip.all
    @all_users = User.all
---
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def gossip
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def user
    @current_user = User.find(params[:user_id].to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]